Although
sense
distribution
data
derived
SemCor
accurate
information
automatically
(McCarthy
al
2004)
domain
words
frequency
distributions
inappropriate
unavailable
Our
final
partial
tagger
re-implementation
algorithm
developed
Yarowsky
(1992)
14
Dagan
Itai
Schwall
(1991)
(1994)
propose
similar
method
instead
parallel
corpus
monolingual
corpora
bilingual
dictionary
Various
corpus-based
approaches
word
disambiguation
proposed
(Bruce
Wiebe
1994
Charniak
1993
Fujii
1996
Hearst
1991
Karov
Edelman
Kurohashi
Nagao
Li
Szpakowicz
Matwin
1995
Ng
Lee
Niwa
Nitta
Sch~itze
1992
Uramoto
1994b
1995)
The
five
seven
features
(Ng
1996)
In
results
reported
1994)
test
set
600
randomly
selected
sentences
2369
accuracy
figures
LEXAS
reproduced
third
row
Table
However
feature
value
pruning
selects
surrounding
local
collocations
values
indicative
class
measured
conditional
probability
(See
details)
(Miller
Leacock
1992)
unordered
perform
WSD
statistical
classifiers
neural
networks
IR-based
techniques
A
supervised
based
property
(Yarowsky
strategies
pseudo
consistently
95%
overall
disambiguating
senses
polysemous
(Wilks
Towell
Voorhees
1993)
100
random
trials
78%
probabilistic
classifier
One
scale
hand
tagging
efforts
subset
Brown
tagged
WordNet
July
2002
pp
Prior
research
shown
using
Support
Vector
Machines
(SVM)
learning
achieves
(Lee
2002)
For
related
example
(Brown
Pedersen
Bruce
1997
Schutze
1998
Kikui
1999
Mihalcea
Moldovan
1999)
intended
deemed
classification
This
contains
192800
sense-tagged
occurrences
191
frequently
occurring
ambiguous
English
addition
11
C31
C32
C23
C13
Yarowsky's
experiment
average
3936
examples
disambiguate
Recent
estimations
inter-annotator
agreement
inventory
report
725%
preparation
all-words
Senseval-3
(Snyder
Palmer
673%
Open
Mind
Word
Expert
annotation
exercise
(Chklovski
Previous
studies
eg
Florian
applied
success
recent
proposals
(Hearst
Towwell
machine
extract
hand-tagged
Like
Cowie
Guthrie
levels
worth
targets
translation
equivalents
(eg
Gale
Church
1992c
Section
23)
Roget
categories
Masterman
1957)
correspond
broadly
wider
homograph
distinctions
approach
combines
knowledge-based
methods
unlike
(arowsky
Miller
takes
starting
assumption
annotated
training
text
available
Many
systems
mentioned
including
currently
advantage
prior
probabilities
disadvantage
relative
baseline
issue
exception
public
variety
employed
task
(see
Mooney
[1996]
Ide
Veronis
[1998]
overviews)
popular
decision
lists
naive
Bayesian
(Pedersen
2000
Cucerzan
attempted
evaluate
refined
distinction
WORDNET
evaluated
sets
SENSEVAL-3
fine-grained
evaluations
conducted
surprising
observation
(Leacock
widely
divergent
sense-disambiguation
algorithms
tend
roughly
evidence
contribution
knowledge
sources
(1)
POS
mor43
Accuracy
Black
(1988)
72%
Zernik
(1990)
70%
79%
LEXhS
(1996)
89%
Comparison
previous
Knowledge
Source
morpho
verb-object
Mean
772%
620%
802%
435%
Std
Dev
144%
182%
155%
179%
Relative
Contribution
Sources
phological
form
(2)
(3)
(4)
verb
left
(verb-object
syntactic
relation)
separate
runs
Most
recently
unsupervised
procedure
tested
binary
coarse
decision-list
identifies
reliably
partition
seed
ranked
purity
Also
semantically
measure
error
rate
10%
They
fall
according
supervision
process
external
resources
thesaurus
lexicons
generate
(Lesk
1986
Lin
McCarthy
2004
Seo
exploiting
differences
mapping
languages
untagged
languages)
Diab
Resnik
2003)
bootstrapping
overcome
bottleneck
acquisition
Park
comparative
paper
volume
\[Leacock
1993\]
investigation
wide
context
pool
independent
position
SVM)
semi-supervised
(ex
Cognitive
Science
Laboratory
Princeton
undertaken
hand-tagging
1000
Corpus
(so
200000
via
ftp)
25
verbs
segment
Wall
Street
Journal
(12925
sentences)
underway
(Wiebe
1997)
contrast
(a
window
words)
build
co-occurrence
model
classes
Roget's
Compared
difference
testing
additional
LK
LDA
L
bag-of-words
topic
represented
K
To
performance
tests
common
larger
separately
collected
Corpus-based
Statistical
Sense
Identification
Work
automatic
identification
1950s
onward
summarized
Hirst
(1987)
researchers
(WSD)
manually
train
backoff
ELS
types
capture
contextual
part-of-speech
neighboring
single
topical
(as
except
relations)
attempt
(McRoy
1994))
obtain
benefit
ranging
collocational
clues
membership
topically
consistency
usages
discourse
(Gale
disambignation
highly
lexically
sensitive
effect
requiring
specialized
disamhignators
We
Bayes
(Soft
Tag)
689
SVM-Topic
660
SVM
652
NB
634
ASO(best
configuration)(Ando
2006)
681
Classifier
Combination(Florian
665
Polynomial
KPCA(Wu
658
SVM(Lee
654
Senseval-2
Best
System
642
Results
(best
configuration)
compared
lexical
sample
simulate
SENSEVAL
tasks
(Edmonds
Cotton
2001
Snyder
mapped
fine
grained
official
answer
keys
respective
beginners
Regardless
dictionaries
thesauri
Walker
Amsler
1986)
1991)
hand-labeled
providing
definitions
considerable
burden
1992a
exemplar-based
(Cardie
etc
particular
state-of-the-art
six
"line"
i994)
dealt
accent
restoration
simpler
Pragmatic
relied
models
Thesaurus
(Chapman
1977)
resource
earlier
(1957)
SENSEVAL-2
SENSEVAL3
(Palmer
provided
tag
content
(noun
adjective
adverb)
running
texts
correct
experiments
follow
individual
parts-of-speech
(POS)
Some
concentrated
producing
base
limited
(1995)
Schtitze
quoted
12
(1993)
namely
deal
1998)
(Schutze
Note
MB-D
directly
mainly
Features
adopt
design
(2002)
consists
following
Local
D2-grams
nearby
(position
sensitive)
Global
(excluding
stopwords)
(position-insensitive
bag
Syn79
tactic
relations
obtained
parser
output
real
size
Teibel
(Sussna
(Agirre
Rigau
mixed
(Richardson
(Resnik
1995))
proposes
completely
avoids
manual
On
past
(or
nearest
neighbor)
achieved
improved
comparable
Naive-Bayes
(Mooney
(Black
1988
1990
comparison
suggestive
found
informative
PEBLS
16%
Among
existing
SEMCOR
It
adopts
heuristics
1992b)
classify
unclassified
P3
P2
P1
P0
Pi
(Pi)
ith
token
(right)
consider
unigrams
(single
These
sentence
support
vector
machines
achieve
Chan
2007b)
Since
(1990
(1992d
FY02
(Florian
WSC04
(Wu
LN02
unseen
sets)
Yogi
sw
(w)
(5)
wiEDef
salient
(swv)
saliency
weight
semantic
tags
Training
WordNet's
Monosemous
Relatives
materials
differs
respects
notably
selection
choice
SThe
column
1997a)
Regarding
portability
disappointing
Several
define
properties
lexemes
(Dyvik
falls
below
twelve
(issue)
needn't
concerned
deviation
Monolingual
Bootstrapping
Stevenson
Wilks
(2001)
somewhat
technique
handle
integrating
LDOCE
simulated
annealing
attached
node
C
P(C)
noun
refers
instance
estimated
concepts
include
distance
589
Computational
Linguistics
Volume
20
Number
metric
vectors
(Schiitze
inspired
retrieval
flip-flop
informants
preferred
trying
maximize
mutual
informant
confidence
intervals
establish
degree
preference
combined
constraint
propagation
(the
current
paper)
Distance
target
purpose
calculated
parameter
Much
2001)
importance
various
improve
introducing
weighting
usually
patterns
global
(bag-of-words)
Similarly
comprising
Different
application
hand-crafted
implementation
exactly
denote
hereafter
expanded
class-based
variant
well-known
rarely
exhibit
implies
closely
associated
low
appearing
document
previously
discussed
literature
language
modeling(Lau
translation(Berger
prepositional
phrase
attachment(Ratnaparkhi
morphology(Della
Pietra
Nave
1992a)
Decision
List
Nearest
Neighbor
Transformation
Based
Learning
(Mangu
Brill
Neural
Network
(Towell
English-Chinese
relatively
easy
extend
discussions
translations
pairs
minimal
structures
restricting
notion
By
neighbors
determining
10-fold
cross
validation
determine
Experiment
Yarowskys
Words
studied
range
dictionary-based
rely
(V~ronis
cooccurrence
frequencies
extracted
textual
(Sch~itze
line
Niu
2005)
Integer
consisting
mean
874%
solve
Towel
Voorheest
weakly
(Dagan
2005
discrimination)
hope
aligned
suffers
availability
frequent
failure
Following
log
ratio
ln(pl/p2)
underlies
Unsupervised
introduced
primarily
default
strategy
picking
advocgted
evaluating
programs
1992b
believed
involve
subtle
human
judgments
genuine
humans
agree
assignments
Syntactic
Relations
homophones
cellar~seller)
created
homographs
stripping
accents
French
Spanish
classifications
avoided
hand-annotate
single-task
External
dependency
(Guthrie
Nasukawa
expected
lead
system
improvement
collect
Disambiguate
Senses
projects
Della-Pietra
Mercer
1993b
Lehman
constructed
2639
containing
occurrence
State-of-the-art
attained
65%
(Fellbaum
adopted
reference
Fortunately
(968%)
experimental
conditions
Both
identical
ones
statistics
guide
generates
list
collocates
(Li
view
reflected
elaborate
estimates
result
explored
assigned
seen
successfully
(and
extensions
variations)
Iterating
identified
(Engelson
Lewis
1994a
More
beyond
selectional
utilized
compare
44
Test
BC50
WSJ6
405%
448%
Frequent
471%
540%
637%
686%
Evaluation
Large
Data
Set
overlap
neighbor
Hamming
symbolic
suggests
multiple
indeed
useful
Califf
provides
utility
representation
natural-language
combination
framework
(simulated
subject
codes
restrictions)
TiMBL
memory-based
(Daelemans
deteriorates
represent
source
corresponding
a52
a4a14a13a59a53a58a4a14a13
a13a59a53a58a13
a4a7a12a57a53a58a4a7a12
a12a57a53a12
a4a7a12a57a53a58a4a14a13
a4a14a13a59a53a58a13
a13a59a53a12
a4a7a6a57a53a58a4a14a13
a4a7a12a57a53a58a13
a4a14a13a59a53a12
a13a59a53a6
union
collocation
(1997)
program
named
(LEXical
Ambiguity-resolving
_System)
involving
"interest"
stateof-the-art
Proceedings
Conference
Empirical
Methods
Natural
dozen
believe
chances
coarse-grained
reasons
due
possibility
reusing
(collocated
employing
relation
(Leroy
Rindflesch
Joshi
Mohammad
glosses
hierarchy
(BoydGraber
2007)
help
choices
Despite
simplicity
Naive
claimed
state-of-theart
papers
1997a
inputs
100-word
scores
1042
Categories
1-\[
Pr(wlRoget
Categoryi)
run
mode
unrestricted
input
Category
Rogets
colleagues
Linguistic
Consortium
(LDC)
International
machine-tractable
applications
(Masterman
(Sparck-Jones
1964
analysis
(Sedelow
Sedelow
\[1969\]
\[1986
1992\])
supplies
explicit
concept
eight
increasingly
levels/Typically
represents
ie
publicly
Achieving
precision
resorting
ad
hoc
voting
ensemble
daunting
challenging
benchmarks
nave
Chodorow
creating
classified
building
designed
looks
kk
positions
lemma
forms
morphological
assignment
performed
lookup
trained
duty
('obligation'
'tax')
investigated
interaction
definition
estimation
keywords
Indeed
26
outperformed
heuristic
choosing
(which
615%
recall1)
M57M02M21M13M01		Many
\[Brown
1991\]\[Hearst
1991\]
discrete
questions
(such
word-to-the-right)
development
procedures
consisted
121
nouns
70
"the
English"
44)
includes
Veenstra
effective
concept-learning
(Clark
84
Niblett
1989
Quinlan
requires
little
user
start
American
parsed
verified
Penn
T~eebank
project
(Marcus
describe
threshold
dynamic
adjusts
amount
estimate
pl
p2
2-sentence
LP
art
(Mihalcea
Collocations
Collocation
Cij
sequence
tokens
(words
punctuations)
denoted
respectively
negative
C11
C22
C21
C12
implemented
successful
significant
2476
Longman
Dictionary
Contemporary
(LDOCE)
evaluation
exercises
Kilgarriff
systems??results
Notice
calculation
MFS
exploit
rankings
appear
50
reader
referred
thorough
surveys
reports
96%
one)
light
state-ofthe-art
Furthermore
apply
powerful
"one
discourse"
meant
adapt
original
type
occur
Sch6tze
exploited
derive
232)
described
attributes
morphology
balanced
dataset
lexicographers
learn
seAs
sociation
Semantic
Analysis
Text
Barcelona
Spain
Third
Workshop
Systems
mantic
drawn
generalizations
(Kohavi
208
John
extensively
decade
improving
diverse
NLP
(Brill
Wu
van
Halteren
chunking
(Sang
2000)
parsing
(Henderson
(Kilgarriff
Rosenzweig
Further
details
When
none
remains
rule-based
method)
simply
appears
database
sixfold
cross-validation
divided
training/test
equal
effectiveness
augmenting
experimenter-supplied
manufacturing
plant
life
plant)
(sense
6)
(Vapnik
file
standard
(one
sense)
derives
(4th
edition)
speech
incorporated
cross-lingual
idea
2003
WordNets
multilingual
(Tufis
92%
nearly
13%
(translation)
refer
(MB)
Currently
Atserias
Agirre
combinations
Supervised
improves
examplar
SENSEVAL2
tree
SENSEVAL-1
Adaboost
proves
methodologies
(Pealersen
1997))
finding
emerged
significantly
80%
87%
1996))
shallow
co-occurrences
prove
stronger
contributors
deeper
linguistically
motivated
relationships
ACL/DCI
Printing
House
Blind
subsequently
five-fold
assess
sampled
tbr
gained
(selectional
preference)
tile
(disambiguation)
vice
versa
reminiscent
Riloff
Jones
(1999)
135
Dora
br-a01
corlms
wlfich
measurements
applicability
readable
Total
S1={tank
571664
S2={tank
23
36
65
24
[Note]
S1
container
storing
liquid
gas
S2
enclosed
heavily
armed
armored
vehicle
(e)
Polysemous
title
(applicability=920%
precision=815%)
Correct
S2S3
S4
S1={title
43100246
S2={title
62601538
S3={title
11011
S4={title
3306012
533108810
name
person
his/her
sign
rank
profession
book
play
S3
legal
own
winner
sports
competition
(f)
trial
precision=924%)
S5
S1={trial
623000570
S2={trial
4230002
29
S3={trial
000001
S4={trial
000000
S5={trial
626000810
court
examines
quality
usefulness
players
ability
annoying
difficulties
troubles
instances
first-language
statistically
Under
maximum
entropy
(Berger
assumptions
independence
rich
space
lemmas
positional
relationship
soft
capturing
immediate
contextThese
effectiveness)Their
illustrated
acquire
contexts
category
Lins
(1998)
information-theoretic
similarity
commonly
lexicon
demonstrated
First
67
predominant
detection
Lesks
Walkers
(Walker
Conceptual
Density
PageRank
demanding
terms
fail
deliver
k-NN
accuracies
requirement
renders
unsuitable
scarce
Disambiguation
outperform
(Veronis
GWS
originally
(hereafter
SE-3)
particularly
amounts
CSF
(Zhang
explain
prefer
datasets
SemEval-2007
(Pradhan
documents
(350
versus
3)
allowing
reliable
comparing
graph-based
(S2AW)
(S3AW)
labeled
17
Typically
calculating
relatedness
(MFS)
participated
(SMUaw
GAMBL
respectively)
alternatives
(Cowie
conceptual
density
tried
suboptimal
word-by-word
time
performing
Pradhan
typically
expensive
Elesk
nd
dened
nding
lesk
denitions
Jiang-Conrath
(jcn)
(Jiang
Conrath
produced
hyponym
links
inducing
preferences
level
(for
applications)
(Erk
provide
direction
viewed
proposal
transformation-based
Winnow
(Golding
Roth
boosting
(Escudero
Marquez
Let
After
employ
one-sense-per-discourse
article
in-depth
study
acquiring
raw
2004a)
plenty
gold-standard
Preiss
Edmonds
directions
a114
(PoS)
2004c)
PoS
(Cotton
From
2004b)
continue
experimentation
future
ranking
score
estimating
sufficiently
rarer
purposes
jcn
structure
considerably
revisit
news
finance
produces
intuitive
domain-specific
(Koeling
Carroll
(Stevenson
investigating
facets
But
(in
other)
substantially
worse
plateaued
figure
arithmetic
published
treatment
multiwords
lexicographer
intuition
whereas
Word-sense
reach
handcrafted
linguistic
world
Lai
At
training-set
copy
network
SULU
supplying
synthesize
upper
bound
generation
monosemous
relatives
Martinez
bootstrapped
bearing
(Diab
volunteer
contributions
Web
Starting
collection
annotations
generated
competitive
initially
Galley
McKeown
Navigli
Velardi
data-driven
date
constantly
observed
leading
participating
integrated
phase
suffered
hard
carefully
Litkowski
tuned
speci
constrained
scarcity
Two
investigations
included
adding
611%
Experiments
As
assessed
clustering
allwords
(a)
coded
Lesk
(b)
acquired
induce
Schtze
(c)
hybrid
mix
characteristics
supported
(Chan
setting
access
EMbased
section
priors
effectively
DSO
BC
WSJ
sense-annotated
(SC)
optimal
search
depth
maximizing
Degrees
F1
chosen
Related
Earlier
encoded
follows
16
Martnez
collective
extent
holds
true
returned
solutions
favour
circumvent
alternative
failed
Semi-supervised
promise
albeit
costs
aim
reducing
effort
cost
collecting
remained
matter
concern
deprived
recovery
distinguish
8It
emphasized
TWS
((Brown
1992))
marked
**
defined
listed
corresponds
thesaurus-based
suffer
loss
(since
semi-class-based)
sparseness
H
Classes
taxonomy
require
substantial
(Kelly
Stone
1975
relies
dilution
noise
1792
defining
introduces
publications
Numerically
methodology
explicitly
noted
connection
bringing
phenomenon
combining
principled
manner
chose
disambiguated
broad
considerations
resolved
factors
ambiguity
resolution
perfromed
(that
attempts
option
gathered
(supervised
methods)
(unsupervised
There
combine
(Rigau
moved
recognized
ontologies
Sensus
Cyc
EDR
EuroWordNet
machine-readable
OALDC
Webster's
material
Resources
focuses
(nouns
verbs)
Escudero
word"
209
concluded
Unconstrained
CL
Lafferty
(Blum
Mitchell
reduce
unannotated
entity
recognition
(NER)
traditionally
assigns
1http//classinrialpesfr/
(after
removing
stop
de
nition
mwi
??MW
multiword
majority
vote
item
MWsys
T
response
mwsysi
specified
P
=summation
mwsysi?MWsys
exists
|MWsys|
(9)
R
mwsysi?MW
|MW|
(10)
summation
(11)
(12)
31
Baselines
baselines
21
1993a)
distributional
measures
MELB
1993b)
filtering
infrequent
synonyms
UNT
host
engines
Hence
besides
gathering
Research
gather
followed
parts-ofspeech
hypothesis
alignments
approximate
Moreover
attain
(Basili
incoming
MT
2007
Carpuat
LBXAS
smil~to
case-based
reasoning
foundation
Kenmore
train/rig
1000-1500
e~mples
dJ-~mhiguation
algorjthm~
fzom
Attempts
alleviate
tagbottleneck
i~lude
tmotstr~ias
(Te~
ot
ill
algorith~
199s)
Dictionary-based
ma~l~i~e-readable
(Luk
1990)
e0(ploit
disaznbiguation
algorit~m~
rivals
examine
addressed
resolve
fine-grain
excess
Using
base-line
most-frequent-sense
classitier
WoRDNET
78
120
SEMCOI~
prepared
SPMCOR
yield
coverage
initiated
mini-project
investigate
ran
exemplar
L~XAS
varying
curves
(details
consistent
discourse)
Because
preceding
wordsense
concordance
files
counted
1995)(Agirre
challenge
fine-grainedness
862%
712%
recall
614%
drug
times
bigger
914%
impressive
939%
syntactically
analysed
(SemCor)
