Nivre
Nilsson
(2005)
restriction
projective
dependency
graphs
lifted
using
graph
transformation
techniques
preprocess
training
data
post-process
parser
output
so-called
pseudo-projective
parsing
However
tractable
models
forced
restrict
features
limited
history
decisions
(McDonald
Pereira
2006
McDonald
2007)
Edge-factored
computational
benefits
notably
inference
nonprojective
achieved
polynomial
time
al
2005b)
The
state-of-the-art
statistical
parsers
discriminative
meaning
based
classifiers
trained
score
trees
sentence
via
factored
whole-structure
scores
2005a)
local
decision
(Hall
2006)
Although
higher-order
MST
slow
exact
requiring
O(nk)
kgram
subtrees
approximated
model
future
Yet
parsed
O(n3)
(Eisner
1996)
Dependency-based
syntactic
widely
technique
natural
language
processing
proposed
recent
(Yamada
Matsumoto
2003
2004
2005a
Titov
Henderson
2007
Martins
2009)
Our
observation
accuracies
systems
considerably
below
90%
unlabeled
88%
labeled
attachment
English
reported
previously
Hall
When
analysis
coupled
algorithms
Eisner
(1996)
andPaskin
(2001)
beginto
aclear
picture
complexity
data-driven
edge-factored
framework
In
conditional
log-linear
(which
closely
related
random
fields
(Lafferty
2001))
distribution
structures
defined
follows
p(y|x)
1Z(x)
exp{g(xy)}
(1)
Z(x)
partition
function
parameter
vector
g(xy)
summation
display
(hml)y
wf(xhml)
Here
f(xhml)
feature
representing
(hml)
context
(see
example
2005a))
reduces
a18a37a36
a1a39a38a41a40a43a42a45a44a46a38a48a47
a49a22a50a41a51a53a52a55a54a57a56
a58
a52a60a59a62a61a5a63a64a59a66a65a43a56a67a50a26a49
sa2a5a4a29a19a22a21a23a4a25a24a28a16
sa2a5a4
a19
a21
a4
a24
a16
depend
measurable
property
a4a20a19
a4a25a24
tree
a18
This
formulation
suf
ciently
capture
including
probabilistic
(Wang
2005
non-probabilistic
Wang
All
comes
CoNLL-X
Shared
Task
(Buchholz
Marsi
specifically
sets
freely
available
online
(2006)
shown
incorporating
relating
adjacent
edge
pairs
improves
accuracy
maximum
spanning
(MST)
We
describe
main
paradigms
learning
shared
task
call
transition-based
(section
52)
graph-based
53)
adopting
terminology
(2007)5
Finally
overview
domain
adaptation
methods
54)
tested
hypothesis
Charniak
(2000)
n-best
mode
producing
top
10
corresponding
probabilities
dominant
method
tradition
support
machines
(Kudo
2002
Yamada
memory-based
(Nivre
Scholz
Attardi
For
treebanks
non-projective
transform
treebank
2005)
algorithm
separate
labeling
Transition
Precondition
NivresMethod
Left-Arc
(|wiwj|A)
(wj|A{(wjwi)})
0wk
(wkwi)
A
Right-Arc
(|wi|wjA{(wiwj)})
Reduce
(|wiA)
(A)
wk
Shift
(wj|A)
(|wjA)
Proposed
Method
(|titj|A)
(tj|A{(wjwi)})
(|tiA{(mphc(titj)wj)})
(tj|A)
(|tjA)
studies
taking
approaches
2002)
2003)
deterministic
incremental
generalized
transition
system
2008)
It
extracted
lexicalized
phrase
structure
(Collins
1999
2000)
typically
accurate
produced
pure
details
refer
reader
2004)
Statistical
active
research
linguistics
community
construction
Penn
Treebank
(Marcus
1993)
factorizations
domains
Y()
solve
maximization
efficiently
efforts
concentrated
designing
increased
sensitivity
2000
2005b
Carreras
evaluated
classifier-based
best-first
Wall
Street
Journal
corpus
standard
split
sections
2-21
section
22
development
tuning
parameters
23
testing
As
bottom-up
strategy
bottom-up-trees
Buchholz
contrast
shift-reduce
described
(2003)
bottom-up/topdown
hybrid
bottom-up-spans
starting
re-implementation
McDonalds
rewriting
Syntactic
particular
syntactically
annotated
corpora
simplicity
single
makes
pass
input
whereas
involves
preprocessing
post-processing
building
analyses
1996
SekineUchimotoand
Isahara
comparison
Sp
strictly
recover
dependencies
step
Natural
dependency-based
frameworks
received
increasing
amount
attention
To
overcome
15We
leave
experiments
F
=2
precision
recall/(precision
recall)
figure
decreases
length
increases
found
derives
allows
captured
pseudo
approach
These
settings
match
evaluation
setting
previous
Koo
popular
structured
perceptron
averaging
train
projectivized
versions
trees2
1We
grateful
providers
constituted
(Hajic
Aduriz
Mart
Chen
Bohmova
Marcus
1993
Johansson
Nugues
Prokopidis
Csendes
Montemagni
Oflazer
Parsing
search
entire
space
restricted
relation
MSTParser
043b
1-best
decoding
NP-L
list-based
P-L
PP-L
P-E
arc-eager
stack-based
PP-E
P-S
arc-standard
PP-S
McD
Lerman
Niv
technologies
improved
past
high-performance
PCFG-based
(Charniak
Klein
Manning
Johnson
Petrov
include
Sagae
Tsujii
deep
(Kaplan
Clark
Curran
Miyao
Global-optimization
common
key
difference
shift
reduce
CFG
(Sagae
Lavie
2006b)
CCG
actions
action
word-lexical
category
pair
head
chart
item
left
periphery
parse
introduced
compared
probability
(English)
Thus
normally
run
linear
quadratic
greedy
fixed-width
beam
cubic
efficient
global
practically
feasible
similar
voting
prefix
word
form
instead
character-level
Chinese
essentially
Graph
transformations
recovering
introduction
edges
learned
paper
bigram-subtrees
trigram-subtrees
theory
k-gram-subtrees
trigram
(k-1)th-order
mentioned
grandparent
type
(2007)
out-of-domain
(WSJ)
portion
consists
40000
sentences
(one
million
words)
information
Despite
partial
correspondence
proves
effective
leads
achieve
5%
average
UAS
Dutch
assume
complete
Y
probabilistically
motivated
decomposed
sum
link
(a
pair)
Satta
(2006a)
Zeman
abokrtsk
observed
reversing
direction
stepwise
beneficial
combinations
There
See
failures
practice
leaving
fragments
stack
Like
context-free
grammars
sufficient
represent
linguistic
phenomena
languages
advantage
parsable
solved
Gomez-Rodrguez
forests
strong
independence
assumptions
Notably
simple
arc-factored
level
obtain
O(n2)
stacked
outperforms
earlier
approximate
(2004)
developed
suitable
amounts
text
required
retrieval
applications
Before
POS
tags
assigned
reimplementation
POStagger
Collins
(2002)
Either
employ
non-standard
combine
non-adjacent
substructures
try
non351
ROOT0
A1
a7
a63
DET
hearing2
SBJ
is3
ROOT
scheduled4
VG
on5
NMOD
the6
issue7
PC
today8
ADV
a4P
Figure
Dependency
(non-projective)
Oracles
practical
obtained
Comparison
Related
Work
Several
ensemble
2008
DellOrletta
2009
Surdeanu
2010)
define
second-order
interactions
siblings
allowed
defines
sibling
Given
high-quality
parses
machine
translation
(Xu
generation
(Wan
summarization
(Owczarzak
annotation
two-stage
extending
SS-SCM
(Carreras
Things
worse
conditions
(and
hence
splits
dynamic
programming
according
to)
node
addition
parent
multiplying
Models
roughly
divided
Graph-based
performing
generative
adding
prediction
Practically
lattice
Gss
straightforward
generalization
child
dependent
occurring
grandchild
Both
tagged
implementations
tagger
WSJ
CTB
50
respectively
ULISSE
datadriven
firstorder
Maximum
Spanning
Tree
DeSR
(Attardi
Support
Vector
Machine
employs
own
extension
Eisners
relations
Most
focused
Unsupervised
seen
rapid
progress
recently
error
reductions
15%
six
(Klein
Spitkovsky
results
(Gillenwater
2010
Naseem
seeds
language-specific
rules
(Druck
cross-language
(Smith
Spreyer
inspired
successful
Then
substitute
Step
supervised
MIRA
incorporates
q1
real-values
phrase-structure
generatively
joint
P(xy)
One
surprising
discovered
constituent
eg
minimum
vein
CoNLL
challenge
jointly
(extracted
semantic
PropBank
(Palmer
c2008
Deterministic
conducted
MaltParser
2007b)
spirit
following
novel
contributions
stacking
interpretation
richer
set
includes
non-local
(shown
improve
performance)
variety
architectures
Note
expressiveness
factorization
Model
enclosing
grand-sibling
tri-sibling
current
provide
Table
additional
statistics
reparsing
focus
articles
153
Comparing
baselines
observe
line
combining
parsers14
Notice
configuration
(eliminating
tune
parsers)
R
O
T
ISBN
considered
Freund
Schapire
(1999)
originally
averaged
substantial
improvements
tagging
tasks
1149
determine
words
instance
modified
CKY
(2002b)
convergence
proofs
(2002a)
directly
compares
boosting
named
entity
Duffy
(2001
reranking
kernels
allow
representations
sequences
very-high-dimensional
spaces
First
implement
chart-based
2nd-ordered
develop
procedure
handling
suggested
applying
lifting
arcs
repeatedly
mean
1999)
measure
By
nave
O(n5)
1996)6
due
factors
maintain
draw
(unlike
CKY)
importantly
increment
ality
runtime
(easily)
Again
neither
nor
BPM
measures
conclude
constitute
valiation
version
30
head-finding
propose
42
application
types
subsection
43
examine
propagating
first-stage
process
41
Feature
engineering
original
format
columns
12)
morpho
column
overall
performance
relaxed
outperform
arcfactored
significance
(p
001)
Dan
Bikels
randomized
(http//wwwcisupennedu/dbikel/softwarehtml)
report
twelve
2006)5
(LAS)
default
settings6
measured
comparator
10000
iterations7
enumerated
various
subsets
depicted
Algorithms
implementation
applicable
(Aho
1986)
equivalent
relevant
mapping
underlying
scored
factoring
performed
searching
scoring
LR-like
PCFG-like
(using
markov
grammar)
extend
applied
means
Recently
13
Conference
Computational
Language
Learning
(CoNLL)
Consequently
powerful
requires
O(n4)
NP-hard
baseline
represented
Sentence
Length
(SL)
assumption
demonstrated
harder
analyse
short
ones
result
confirm
Novk
512
phenomenon
non-projectivity
ignored
ignoring
significant
real-world
(around
15a37for
DDT
23a37for
PDT)
extends
first-order
incorporate
yielding
Following
Variables
agenda
items
indexprev
indexes
Input
POS-tagged
With
projectivity
constraint
arc
weaker
(permitting
parses)
quadratic-time
exists
(Chu
Liu
1965
Edmonds
1967)
Unlike
definition
Right-Arcr
wj
NLP
surge
focusing
(including
MSTParser)
limit
scope
(usually
two)
and/or
resort
experimental
evaluations
2007a
write
act(i)
denote
representation
act
location
variant
(Shen
Shen
Joshi
replication
except
modifications
footnote
Berkeley
(Petrov
latent-variable
PCFG
extensive
parsingfor
parsing(Eisner
Paskin
2001
Yamadaand
McDonaldet
systems(Nivre
Nilsson2005Halland
Novak
2005McDonald
Instead
incorporated
templates
beam-search
(2008)
mainly
theoretical
empirical
2planar
easy
PA
Perceptron
(PC)
Kudo
week
Japanese
8000
SVM
rearrange
postprocessing
graphbased
major
benefit
choice
efficiency
exhaustive
notions
separability
size
GEN
Two
questions
mind
behavioral
differences
implemented
participated
multilingual
track
head+path
schema
direct
(Table
3)
MSTMalt
hints
Maltparser
Malt
04
05
06
07
08
09
15
20
25
35
F-Measure
Left-to-Right_DeSR
Revision_DeSR
Looking
rst
times
obvious
depends
primarily
instances
magnitude
biggest
(Czech)
(Slovene)
14
iterative
created
HPSG
generated
22)
combination
scheme
outputs
substantially
table
reports
Scholzs
andMatsumoto(2003)
andMcDonaldandPereiras
expected
degrades
rapidly
propagation
bring
stateof-the-art
outcome
inferring
specific
extended
(for
Swedish)
English)
Bengoetxea
Gojenola
(2010)
discuss
Basque
dataset
date
(927%
UAS)
combines
predictions
pre-existing
Nivres
final
note
test
examples
(1996a)
back-off
conditioning
C(ij)
exp(w
f(ij+))summation
f(ijr))
exp(
fk(ij+))summation
fk(ijr))
(5)
Features
Classification
classifier
1st-ordered
Malt-06
MST-06
integrated
guided
currently
Many
standardized
formats
Moreover
(1997)
O(n3q3)
DP
Danish
datasets
prepared
Arabic
Czech
Riedel
Clarke
moreover
feature-based
Tournament
9196
5744
SR
(Sassano
9148
5567
CC
9147
5565
Combination
Relative
preference
Kudos
9166
5630
9137
5600
9123
5559
[%]
24263
Kudo(2005)s
dominating
MST-parsing
2006a)
bare
bones
approximates
semanticsand
hast
admitting
fast
negligible
grammar
constant
Factorizations
augmenting
spans
indices
modifiers
leading
limitations
4The
reason
grand
derived
7(b)
recursively
copy
index
reuse
g-spans
6(b)
Though
(PTB)
Huang
broad-coverage
Ensemble
inspiration
refined
weighting
schemes
weights
range
apply
semi-supervised
automatically-assigned
loopy
BP
hill-climbing
Tractability
usually
ensured
forbids
Some
1997
free
worth
noting
units
sometimes
conventional
partly
explains
low
tokens
Therehas
Paskin2001
Scholz2004
2005a)and
andNilsson2005HallandNovak
increase
2010)2
attractive
Subsequent
likelihood
(ie
entropy
(Ratnaparkhi
Indirect
gained
Swedish
(85%
score)
contains
proper
seven
(Danish
Portuguese
Slovene
Turkish)
CoNLL-2008
(Surdeanu
2008)8
(UAS)
settings9
featuresasMcDonaldetal(2005)(include
dint
toolkit10)
3335
employed
look
part-of-speech
tag
(if
available)
morphological
correlated
indicator
variables
sequence
greedily
choosing
successive
transitions
1994
understanding
matters
replicate
errors
structural
properties
Much
fueled
availability
especially
becoming
multiple
corresponds
Baseline
condition
Markov
yield
relative
27%
20%
(2006)s
9%
7%
provided
candidate
discriminatively
Example
21
wide
(2003
belong
family
Single
tends
suffer
affecting
originating
artificial
root
fragmented
parses9
question
alleviated
views
component
Blended
treated
black
box
investigated
Right-to-left
ensemble-based
CONLL-2007
Catalan
Italian
Hungarian
Turkish
lot
couple
2003)s
2006)s
values
vectorw
sheet
contest
nondeterministic
performs
pursuing
path
fashion
published
80%
reaches
82%
adapted
Charniaks
84%
(Jan
Hajic
pers
Corresponding
manipulations
studied
constituency-based
dominated
field
manipulate
40
noted3
am
able
competitive
art
An
enables
globally
maximize
MSTParser6
parent-child-grandchild
stage
augmented
subset
Table3
Unlabeled
choices
17
CoNLLX
2006)where
difcult
organizers
fair
evaluate
latter
pre-and
Consider
converting
selection
follow
bit
lemmas
morphologic
distance
forms
Such
commonly
referred
factor
individual
(Paskin
2005a)Edge-factored
shave
benefitsmost
time(McDonaldet
2005b)Theprimary
treating
independent
realistic
Interestingly
distinction
kinds
argue
consistent
observations
clearest
patterns
near
depth
opposite
trend
lexical
speech
(POS)
(as
2005))
produce
classier-based
theorem
proof)
Theorem
(xiyi)
separable
margin
value
Ne
8i8z
GEN(xi)
jj
(xiz)jj
implies
U
zero
finite
iterations
converge
Unfortunately
compare
parsers9
functional
subjects
objects
etc
script
constituent-to-dependency
conversion
routine
conjunction
concrete
simulates
bilexical
independently
dependents
bottomup
style
tailored
scenarios
terms
Classier-based
pioneered
head-nal
Ensemble-based
attracted
Fishel
learn
large-margin
optimize
correct
incorrect
Conversion
Dependencies
321
large-scale
construct
dependency-annotated
automatically
Follow
factorize
s(xy)
design
Previous
relationships
successfully
Since
believe
promising
situations
require
robust
(almost)
capturing
corrective
modeling
constraints
intermediate
built
briefly
review
description
(CoNLL-X)
base
confirms
constituency
(at
here)
(baseline)
bigrams
contextual
surrounding
34)
detailed
reveals
associated
enhanced
(ikj)y
s(ikj)
same-side
children
onthe
mostrecent
thatis
picked
analogous
perform
label
access
passed
(Tarjan
1977)
2006)1
slightly
third
Eq
considers
update
weight
vectors
iteration
alleviate
overfit
ting
Mr
Tomash
remain
director
emeritus
inference-based
passive
aggressive
(Nguyen
Schiehlen
Spranger
(Shimizu
Nakagawa
(Nakagawa
Givenann-wordinput
theparser
begins
seeks
highest-scoring
legal
formed
n1
favourable
complexities
hard-wiring
linear-time
worst
Weal
thirteen
task(Buchholz&Marsi
CoNNL-X
(Johansson
Local
mislead
deadend
interpretations
PTREE
(projective)
inside-outside
combined
stateof-the
publicly-available
2005)6
filters
carrying
extraction
(Kromann
Alpino
(van
der
Beek
TIGER
German
(Brants
Floresta
Sintactica
(Afonso
(Dzeroski
2006)4
reserved
pseudo-random
integrates
word-pair
classification
reminiscent
self-training
(McClosky
2006a
Harper
co-training
(Blum
Mitchell
1998
goal
super
marginal-based
varying
degrees
Averaging
help
Combinations
explored
percentage
Complete
Y&M2003
903
384
CO2006
908
376
Hall2006
894
364
Wang2007
892
344
Z&C2008
921
454
KOO08-dep1c
9223
KOO08-dep2c
9316
Carreras2008
935
Ord1
9095
3745
Ord1s
9176
4068
Ord1c
9188
4071
Ord1i
9168
4143
Ord1sc
9220
4298
Ord1sci
9260
4428
Ord2
9171
4288
Ord2s
9251
4619
Ord2c
9240
4408
Ord2i
9212
4437
Ord2sc
9270
4656
Ord2sci
4715
demonstrate
complementary
hand
subtreeand
cluster-based
integrating
chapter
basic
template
(Lombardi
Early-style
unlike
state-ofthe-art
easier
estimates
pipelines
Pseudo-projective
dealing
That
builds
simultaneously
simpler
faster
Boosting
MaxEnt
Recent
reduction
44%
larger
121%
loglinear
Toutanova
written
G
argmax
G=(VA)
(ijl)A
s(ijl)
finding
directed
change
explore
lines
1996Paskin2001Yamadaand
andNilsson2005HallandNovak2005McDonald
typed
French
architecture
featuring
radically
released
Organizers
ten
formalisms
(Clark
Except
software
projectivization/deprojectivization
lags
state-of-theart
PTB
sense
Brown
Corpus
investigate
upper
bound
gold-standard
Agirre
dependencyconstraintsontheHPSGTreebank(Miyao
1993)1
Compared
offers
comparative
freedom
exemplified
2006b
advances
()On
On
disambiguation
crucial
Algorithm
Average
multiclass
S=
(xiyi)N0k
=vector0
kY
choose
Et
={rY
xjtrxjtyj}
if|Et|>
t+1r
tr
xj|Et|
rEt
t+1yj
tyj
+xj
1T
summationtextt
tk
34
Higher-order
costs
If
constrained
EM
easily
compute
marginal
pattern
explained
methodology
relatively
(approximately
5000
training)
resulting
847%
806%
2004)1
comparable
difficult
assess
findings
reasons
benchmark
ideal
Chu-LiuEdmonds
Eisner's
2006/7
2007a)
punctuation
identified
furnished
disjoint
train/test
Combinatorial
time4
cubic-time
Nilsson2005Hall
displayed
lead
significantly
firstand
(parent-sibling)
(parent-child-grandchild)
Classifier-based
select
appropriate
Shift/Reduce
graphs3
exploiting
characterized
operational
(i
j)
iff
nodes
(where
dominates
transitive
closure
relation)
solves
parse(s)
argmaxts
[hm]t
f(hms)
(Crammer
Singer
modifying
third-order
topic
explanation
left-to-right
right-to-left
approximations
maximizing
permit
estimating
clusters
estimation
modification)
Shift-reduce
initial
viewed
regularize
posited
(sections
2-21)
(Section
23)
links
drop
116
analysing
negative
impact
Similar
regarding
effect
contrasts
spanning-tree
manifold
conferences
(among
2009))
comprising
collections
instrumental
After
computes
experiment
converted
twostage
(Aduriz
Bhmov
Haji
trio
plays
Elianti
column-based
subsequent
followed
Zhang
American
unrestricted
(MacDonald
computed
Parsers
attempt
disambiguate
completely
derive
packed
forest
applies
top-down
probable
More
weighted
manner
improvement
non-directional
projectivize
prior
approximation
Sassano
minor
shortcoming
introduce
takes
Best
Examples
Pereiras
Nilssons
creates
specially
marked
transformed
measuring
multi
planarity
reduced
connected
crossings
separately
cycle
considered5
tend
proportion
components
k-colourings
quickly
brute-force
At
reach
surpass
optimal
N&N2005
five
CoNLL-Xshared
Columns
24
enumerate
LAS
MST2O
designed
Prague
Exact
NP
hard
(Neuhaus
Broker
bootstrapped
assembled
competitions
indicate
nearly
differing
minimally
concepts
codification
surface
distances
Beam
Search
researchers
dealt
early-commitment
flavors
130
head-table
02-21
Mc06
Specifically
view
approximating
empirically
dubious
(eg
solving
(generally
NP-hard)
integer
program
(Riedel
latent
(Titov
Furthermore
homogeneous
2007)6
cover
19
languages7
splice
introducing
grandmothers
grand-daughters
trainand
test-sets
classier
(2002)Yamada
(2005)among
MacPro
28
Ghz
(2)
adopted
outlined
feeding
Overall
inferior
(915%
Over
decade
tremendous
(Magerman
1995
Ratnaparkhi
PDT
presumably
illustrate
search-based
Used
Selecting
basically
target
wi
2stage
cant
largest
source
convention
exclusively
authors
heuristics
constructions
create
majority
attempts
exploring
describes
constructing
50-best
coarse-to-fine
MSTC
MSTE
Chu-Liu/Edmonds
Chu
MSTCL/E
interestingly
mitigate
While
single-parser
4We
implementing
successes
Supervised
(Taskar
ef
ILP
add
signi
bl
row
1)
supported
variants
Indeed
voted
gains
reducing
threshold
included
achieves
NO-RERANK
(2000)s
trees3
parameterized
carefully
hand-tuned
heads
symbols
ancestor/sibling
(2009)
swap-based
reordering
shift-reduce-style
easy-first
Goldberg
Elhadad
providing
comparisons
Elhadads
MALTPARSER
MSTPARSER
renewed
literature
(Quirk
(Culotta
Sorensen
true
(Sleator
Temperley
sorts
(MST1)
(MST2)
parser4
Parser
faithfully
(Xue
(gold
tags)
tagger3
ChuLiu-Edmonds
(CLE)
ch
decoder
metric
traditionally
whereby
correctly
head-dependent
counted
towards
success
top-1
CW-classifers
Additionally
LR
bestfirst
(Tomita
1987
1990)
Tomitas
stack-merging
operations
shared-tasks
Now
distinct
positions
online-learning
2006)a
0825
0866
(Chen
0852
0884
Ours
0861
0889
aThis
alternative
alters
raising
governor
whenever
Bilexical
effectively
subordination
wish
extract
explores
multi-lingual
CoNLL-2006
CoNLL-2007
straight-forward
O(|L|n2)
horizontal
Markovization
FNP-hard
proven
useful
formalism
leveraged
feature-rich
Taskar
throughout
iters=10
training-k=1
decode-type=proj
intractable
break
minimal
encoding
called
HEAD
rh
Ablation
understand
ran
ablation
listed
emulated
Section
43)
expanded
annotators
knowledge
closest
modifier
(ch)
behavior
somewhat
Distance
S0
N0
Direction
From
replicated
2(x
c)
dir
cpos(xh)
cpos(xm)
cpos(xc)
form(xh)
form(xc)
form(xm)
Experiments
Results
2007)1
(Freund
xi
i-th
CKY-like
2)
diverse
clustering
analog
product
experts
Chu-Liu-Edmonds
proposes
rich
tag-pair
rearrangement
crossing
achieving
Head
Discriminative
histories
Using
study
influence
Support-Vector
Machines
placing
CoNNL
SVMs
Memory-based
flat
productions
L(xiklk1lk)
R(xikrk1rk)
y|i
Wetrained
onprojectivized
(Oflazer
illustrates
start
estimate
2-planar
They
C
1996b
1996a)
(CRF)
2001)
(with
2-edge
factors)
BohnetParser
(Bohnet
Chu-Lius
1965)
exact-inference
Lavies
kNN)
variation
1In
custom
hyperedge
tail
fac1Charniak
cites
895%
comparing
537
PTB-10
Training(l/ul)
3026/1016
Dev
163
Test
270
PTB-15
Training
7303/2370
421
603
PTB-20
12519/4003
725
1034
CTB4-10
642/347
61
CTB4-15
1262/727
112
83
CTB4-20
2038/1150
118
CTB4-40
4400/2452
274
240
CTB4
5314/2977
300
289
Size
Experimental
Data
(#
sentences)
remains
introduces
projectivization
encoded
non-terminals
constituents
history-based
involve
ie
972%
accuracy)
headrules
unwarranted
established
arity
nearby
(Koo
Rows
1/2
MSTParsers
papers
produces
encode
labels
deprojectivization
participants
(Mart
(Bhmova
Greek
(Prokopidis
(Czendes
(Montemagni
predicting
compatible
But
denominator
Zi
normalizing
sums
dependency-parsing
inside
bottom-up-span
Another
notion
span
ranking
segmentation
2002a)
(Walker
Rambow
Rogati
chosen
criteria
(those
added
advance)
extremely
efcient
detect
violated
No
Cycles
(T2)
(ij)c
dij
|c|1
Comma
Coordination
(C3)
symmetric
token
coordination
comma
aA
dia
|A|1
con
gurations
argument
Compatible
Arguments
(C4)
incompatible
forbid
Selective
Projective
(P1)
triplets
(ijl1)
(mnl2)
eijl1
emnl2
l1
l2
P
32
single-best
suites
788
811
F1
Their
fdep(xthm)
Unigram
whth
wmtm
Bigram
dist
Between
th
tb
tm
Surrounding
th1
th+1
tm1
tm+1
Sibling
fsib(xthsm)
wh
ws
ts
wm
Grandparent
fgrd(xtghm)
wg
tg
gdir
Grand-sibling
fgsib(xtghsm)
2This
composed
grandchildren
outermost
Performance
Alternative
157
P(S
T)
S
P(T
S)
unexploited
connection
pay
closer
minimized
loss
coarse
assesses
total
stable
guide
hash
kernel
Whereas
cutoffs
stopping
stop
contends
harms
regularized
decomposes
TreeBank
549
Linguistics
Volume
Number
Representative
Penn-III
analyze
(specifically
MALT
contain
1967
Assuming
calls
o(c)
t(c)
worst-case
oracle
offer
PredEdge
exactly
noted
outward
modeled
(MIRA)
Differences
chained
finally
matched
al2005b)Theprimary
problemin
dimensions
(cross-validation
SDT
PADT
974
(but
verb
transformations)
handled
reflection
217
learner
Ax
{(ijl)
ij
Vx
L}
Let
D(Gx)
subgraphs
Gx
valid
necessarily
Assume
V
L
s(G
(VA))
represents
creating
priori
stated
123
GD(Gx)
s(G)
originatingoutoftherootnode0
reap
dramatic
(Engel
Roark
inter
alia)
bias
(Bottou
1991)
potential
rate
quality
unregularized
enumerates
Ryan
colleagues
Crammer
nding
optimum
dense
containing
11
edges)
Cheng
CLE
look-ahead
window
distant
analyzer
adopt
head-modifier
SVM-shift
N&S2004
handle
metrics
Parseval
(Black
highly
skewed
grammatical
forces
expensive
span-based
evidence
changing
forward
backward
(of
course
pursued
term
no-3rd
indicates
thirdorder
mappings
fgsib
ftsib
deactivated
lower-order
retained
identical
5)
neighbouring
vertical
neighbour
hoods
existing
improving
simply
projectivizing
(without
inverse
transformation)
possibly
Determining
[f]or
differs
(another
algorithm)
Labeled
(or
root)
Bulgarian
(Marinov
tournament
formalized
(2005a)
optimization
Hidreths
(Censor
Zenios
1997)
tool
Penn2Malt3
convert
2003a)
maximum-spanning-tree
scheme6
(it
sophisticated
attempted)
935%
lower
(about
97%
2002))
Research
Corston-Oliver
string
conditioned
40%
35%
85%
reference
attach
(Model
B)
(2003)5
respect
competition
precisely
Stage
(Zeman
Zabokrtsky
minimizing
coordinated
Treebanks
purpose
Sect
best-performing
corroborating
usage
list
readers
(Multilingual
2006))
(Syntactic
Semantic
Multiple
Languages
1123
(incorrect)
alignment
heeft
You
violating
wellformed3Ie
headedness
acyclicity
projected
(cf
assign
Incremental
Sigmoid
Belief
Networks
(ISBN)
Einarsson
(1976)
extra
redundant
provides
(row
Z&C08
transition)
dynamic-programming
H&S10)
proved
NPhard
Subsequently
begun
porting
(Gildea
McClosky
solely
Currently
appears
culminated
demonstrates
Data-driven
traditional
grandchildren4
resemblance
passing
emulate
demoting
SCOREGS(xghms)
SCOREG(xghm)
SCORETS(xhmst)
SCORES(xhms)
SCOREG
SCORES
SCOREGS
SCORETS
functions
grand-siblings
tri-siblings
preserving
consider
attachments
System
2007b
(MaltParser
combined)
7694%
7575%
7549%
N
(single
parser)
7499%
BDT
7452%
7483%
7708%
effort
keeping
projection
rise
aggressively
filtered
fdep
fsib
fgch
MstParser
2006)wasa
participating
passive-aggressive
reranker
chains
en
kom
ik
formal
correlate
consecutive
special
Preliminary
resulted
(Zhang
runs
(k=1)
beamsearch
(k=16)
eight
configurations
Introduce
reattachment
(Bick
enabled
cost
ideas
trying
829
880
303
(inc
punc)
833
886
313
Bayes
Point
840
888
309
Refer
treatment
According
2003a
arcs)
dimensional
f(ijl)
Rk
binary
CONLL-X
Lemmas
(FEATS)
CPOS
51
setup
partitions
shorter
nouns
determiners
adjectives
pronouns
neighbors
sentence(McDonald
pchemtb-closed
Kulick
nonprojectivity
2007c)
realization
uni
ed
permits
exchange
nonprobabilistic
head-grandchild
account
lack
led
situation
basis
(West
fed
krijg
incorrectly
preposition
om
cient
maximal
serve
proxy
preferences
actual
opposed
merely
speech)
semantics
MRLs
challenging
361
cascaded
chunking
(hereafter
deal
arg
max
Y(X)
score(Y|X)
(xixj)Y
score(xi
xj)
xj
X
sufficiently
696
Precision
Recall
F-score
Time
(min)
Best-First
Classifier-Based
(this
paper)
881
878
879
(MaxEnt)
854
848
851
913
906
910
Unk
Bod
907
145*
895
896
883
882
39
875
863
869
Tsuruoka
865
812
838
1*
868
850
859
2*
860
861
11*
Summary
recall
days
high-order
Exhaustive
capable
levels
despite
(2006b)
alternate
passes
appearing
characterise
ill-nested
classiers
map
NivreHalland
relies
inductive
sentencesand
(Bohmova
(Csendes
2003)1
contribution
1For
Even
preliminary
answer
LCFRS
binarized
sparseness
bootstrapping
suggesting
derivable
lexicalization
linguistically
hand-engineered
subcategorizations
wrong
context-freedom
naive
covering
differentiating
NPs
noun
phrases
phrasal
distinguishing
empty
overt
subject
Third-order
engines
(CTB)
close
assumed
(no
a2a5a4a20a19a15a21a27a4a25a24a28a16
a4a29a19
ancestor
a4a30a19
a31a7a2a32a0a33a16
a0
a18a35a34
obtains
baseline)
792%
labelled
786%
798%
Initialization
[ssdirI/C]
00sdir
nk
Create
incomplete
Lst=V
[stI]=
maxsr<tV
I(r)
Rst=V
Calculate
Ldfst
Rdfst
Update
[stI]=L+st=Lst
[stI]=R+st=Rst
12
[stC]=
C(r)
maxs<rtV
16
thehistory-based
whereV
[stdirI/C]
refers
(line
7)
splitting
return
13and14)
fairly
broad
especiallyintheCoNLLsharedtasksin2006and2007
desirable
adaptations
1-edge
3-edge
3Downloadedfromhttp//source
forgenet/projects/mstparser
averages
linearly
furthest
avoid
pool
categories
frequency
Pseudo-Projective
Decision
Trees(Haruno
1998)
Entropy
models(Ratnaparkhi
Uchimoto
enforce
Integer
Linear
Programming
parsers2
processes
(LR)
goes
right-toleft
(RL)
Occasionally
59
2416
fails
disconnected
expect
(ST)
(cnstr)
Transform
DEPREL
carried
973%
test)
POS-tagging
chartbased
Also
chose
Bayesian
drawn
news
Sections
serving
generalize
well-known
publicly
2005b)1
implements
ex1http//source
159
(212)
parser2
alter
consist
sister
facilitate
training/development/test
corpus10
raw
newswire
text11
balance
similarly
Different
ignore
parent-predictions
tokens13
retain
matches
Pars
erin
tuned
(TF)
(LF)
connecting
variable
(TF-NA)
(Aver)
solutions
Petrovetal(2006)and
effects
(1998)
KleinandManning(2003)andBikel(2004)
arc-reversing
DAGs
posed
yielded
particularly
helpful
identifying
(ij)y
s(ij)
(ij)
high-dimensional
xwi
xwj
brace
Bigg
1if
=prime
hitprimeandxwj
ballprime
0otherwise
answered
x?
edge-factored)
LINK
TREE
material
biological
(development
set)
chemical
(test
(Kulick
optionally
CHILDES
database
(MacWhinney
1973)
regularization
purposes
returns
summationtextTt=1
ty
cause
cf
Time[s]
26396
371
374579
56165
15641
80
94669
37183
18922
99
112759
exhibit
behaviors
Approximate
(although
local)
hill
climbing
Smith
belief
Supported
Lynn
William
Frankel
Center
Computer
Sciences
Ben
Gurion
University
Current
categorized
families
local-and-greedy
optimized
2008))
orthogonal
solution
leverages
strengths
detail
(2007)was
Alternatively
(DP)
looking
f(ij)
Sen
T/S
Lem
CPoS
PoS
MSF
Dep
NPT
NPS
94
52
182
47
156
195
133
146
yes
302
81
26
54
700
392
178
46
278
207
91
228
55
189
29
187
222
Tok
(*1000)
(mean)
lemmatization
coarse-grained
(fine-grained)
(split
atoms)
dependencies/tokens
(%)
graphs/sentences
butin
rely
shift/reduce
PMOD)
Stanfords
(de
Marneffe
branches)
desired
(similar
CYK)
evident
reimplemented
searches
cast
k-best
sand
gold
(ignoring
tokens)
modify
simplify
opted
upwards
trace
enable
recovery
Any
concerning
CoNLLformata
formatare
documentation
Similarly
pays
dearly
fromO(n3)toO(n4)
f2a(xg(x))
fires
predicted
aAg(x)
figures
733
3343
parser1
Non-local
valency)
obtaining
Decoding
Viterbistyle
initially
drawback
mechanism
attaining
(Cheng
NonProjective
Approximation
calculate
counts
(Baker
1979)
matrix-tree
R(TTprime)
Hamming
x0x1
xn
(ij)kET
I((ij)kTprime)
risk
Stepwise
explicit
steps
Dreyer
predict
digraphs
bottom
algorithmsimilartoCKY
encouraging
typological
diversity
Best-performing
slower
implicit
typical
factorized
predictor
occurs
punctuations
(66/84
affects
marginally
(UAS
LAS)
characterize
formalization
generalizes
Setup
(i)
eager
(ii)
trees5
Blaheta
F-measure
989%
assignment
role
(our
(according
model)
f-score
0897
seek
92
h1
h2
r+1
hat
lengthes
shallow
Because
unconnected
labelwe
(2005)which
retrained
excluding
statistically
(Duda
ALMA
(Gentile
Therefore
integration
(Ciaramita
Altun
details)
Hidden
lan968
guage
MaltParser6
MSTParser7
all-pairs
resembles
p)
Wang05
Wang07
McDonald&Pereira06
build
neighboring
Greedy
error-propagation
classical
complicated
arceager
bilingual
prefer
target-side
contiguity
resolving
conflicts
verify
strongly
automatic
alignments
06%
(6%)
overhead
Computation
marginals
reflects
votes
helps
undone
