As
mentioned
(Pradhan
al
2004)
argument
identification
plays
bottleneck
role
improving
performance
SRL
system
This
approach
soon
followed
researchers
(Surdeanu
2003
Pradhan
2004
Xue
Palmer
focus21
ing
improved
sets
features
machine
learning
methods
shared
task
CoNLL
2005
2008
conferences1
Traditionally
constituent
dependency
based
semantic
labeling
steps
classification
(Gildea
Jurafsky
2002)
One
advantage
log-linear
models
SVMs
produce
probability
distributions
590
Standard
Features
PHRASE
TYPE
Syntactic
Category
node
PREDICATE
LEMMA
Stemmed
Verb
PATH
Path
predicate
POSITION
Before
predicate?
For
example
indicators
immediate
syntactic
types
form
flags
raised
punctuation
tokens
nearby
governing
category
feature
Gildea
(2002)
To
develop
automatic
biomedical
domain
train
annotated
corpus
called
proposition
bank
(Palmer
2005)
Others
applied
frame-semantic
structures
question
answering
paraphrase/entailment
recognition
information
extraction
(Narayanan
Harabagiu
Shen
Lapata
2007
Pado
Erk
Burchardt
2006
Moschitti
Surdeanu
2003)
(Xue
fount
suited
sub-tasks
ie
The
partial
trees
output
systems
merged
parse
returned
(Charniak
2000)s
parser
assumption
simple
adaptation
pruning
algorithm
(2004)
holds
vast
majority
arguments
CoNLL-2008
data
training
set
measured
covers
9904%
verbs
9755%
argu2Since
positions
predicates
trained
separate
classifier
using
LIBLINEAR
toolkit
(Fan
2008)
identify
words
Conversely
producing
richer
outputs
concentrated
two-stage
labelling
performed
pipeline
architecture
divided
stages
2002
Nielsen
mainly
author
visiting
student
I2R
Che
We
create
baseline
subset
introduced
directly
applicable
nominal
Our
model
considers
Feature
Set
(FS1)
reported
(FS2)
novel
paper
Shallow
approaches
processing
advances
direction
efficiently
effectively
deriving
application
relevant
explicit
text
Chen
Rambow
Carreras
Marquez
Diab
It
extracted
lexicalized
phrase
structure
parsers
(Collins
1999
Charniak
2000)
typically
accurate
produced
pure
(Yamada
Matsumoto
Researchers
able
construct
reasonable
IE
simply
mapping
specific
Arg
labels
template
slots
completely
avoiding
necessity
building
regular
expression
pattern
matchers
noted
results
kernel
combinations
FrameNet
contrast
(Moschitti
improvement
obtained
evaluation
criteria
predicting
constituents
tree
(Toutanova
valuable
previous
kernels
(TK)
perform
lower
manually
engineered
tasks
eg
Giuglea
2006b
A
realistic
score
tags
assigned
head
considering
exact
boundaries
Hockenmaier
(2003)
Argument
filtering
Previous
shallow
parsing
demonstrated
nodes
equally
probable
roles
Ten
contributed
evaluated
PropBank
Unfortunately
ar667
NP
PP
Peters
laughter
joke
Figure
Parse
sentence
gument
relies
heavily
grammatical
function
(or
alternatively
path)
single
predictor
context
label
formulate
initiated
Support
Vector
Machine
(SVM)
classifiers
(2005)
language
sequences
tackled
independent
global
inference
etc
Some
Koomen
Cohn
Blunsom
Punyakanok
Toutanova
pipelined
attack
In
addition
(2004)s
Tree
Kernel
Tool
compute
compared
proposed
predicate/argument
(PAF)
core
input
914%
SVM
degree
polynomial
2005a)3
result
960%
20
additional
basic
Note
slightly
included
candidate
list
sometimes
takes
consist
sections
Wall
Street
Journal
(WSJ)
Penn
TreeBank
(Marcus
1993)
predicate-argument
Again
concentrate
enriched
Things
worse
described
(2000)
conditions
(and
hence
splits
dynamic
programming
according
to)
grandparent
parent
multiplying
empirical
prior
distribution
Here
defined
Frame
Scheme
Kingsbury
V
verb
A2
beneficiary
A0
giver
AM-TMP
temporal
A1
Recognizing
key
Who
WhenWhat
Where
Why
questions
Information
Extraction
Question
Answering
Summarization
(Melli
NLP
interpretation
Whole
Label
Sequence
observed
including
sequence
helpful
disambiguation
incorporated
inspired
Collins
1999)
classified
five
classes
(a)
capture
internal
(b)
motivation
structured
critical
negation
scope
finding
paid
attention
indicated
studies
(Carreras
M`arquez
Instead
borrowed
existing
literature
While
WSJ
test
significant
degradation
(approximately
10
drop
F-score)
genre
represents
Although
state-of-the-art
sophisticated
statistical
jointly
(eg
Johansson
Nugues
implemented
support
vector
analyze
impact
representation
separately
term
commonly
describe
conveyed
sentential
phrase-structure
represent
generatively
joint
P(xy)
English
analysis
corpora
(Fillmore
2001)
NomBank
(Meyers
created
utilized
augmented
available
project
recently
languages
follow
successful
devised
95
2005b
2005a)
achieves
Fscore
81%
tested
drops
685%
(the
Brown
corpus)
selected
relative
portion
LTAG
derivations
provide
distinct
subcategorization
(SCF)
spanning
(AST)
framework
Of
special
Predicate
convolution
solid
lines
correspond
surface
Charniaks
dashed
encoding
Proposition
Bank
annotation
respect
stopped
adopt
Content
add
informative
word
detected
heuristics
formulated
(SRL)
regard
Hacioglu
2004b
First
candidates
generated
prevalent
heuristic-based
Most
encodes
propositional
adding
layer
Treebank
Though
defines
basis
particular
Arg0
exhibiting
prototypical
Agent
Arg1
Patient
Theme
Propbank
hand-annotated
Approaches
include
incorporating
classifies
report
gold-standard
dataand
automatically
parsed
provided
State-of-the-art
subproblem
additionally
individual
happens
parses
selection
strategy
equivalent
process
selects
sibling
path
ancestors
root
tree2
Their
supervised
evaluations
carried
SVMLight-TK2
software
extends
SVM-Light
package
(Joachims
functions
deep
intend
annotate
semantically
Top-10
combined
SRI
SRC
ranked
z-score
Table
'predicate+head
word'
(c1+c6)
'position+voice'
(c4+c5)
There
growing
body
versions
Zettlemoyer
Ge
Mooney
2007))
rely
human
weaker
forms
supervision
(Kate
Liang
2009
Titov
Kozhevnikov
2010
Clarke
2010)
little
research
considered
unsupervised
setting
experiments
flat
chunked
detail
finite-state
hypothesis
CRFs
date
close
cousin
maximum
entropy
strong
generalisation
Lim
Arguments
Constituents
maps
similar
Among
select
following
Phrase
Type
Word
Head
134
Position
Voice
Partial
No
Direction
POS
Last
Word/POS
Constituent
SubCategorization
(c)
designed
section
1518
development
tuning
parameters
21
All
3/4/5-grams
beginning
Feb
release
PropBank1
(Kingsbury
relations
marked
1994)
speed
four-stage
Stage
save
time
stage
filter
comparable
assumed
Neighboring
(Jiang
shown
importance
capturing
frame
correctly
classify
local
Whereas
constraints
account
(Punyakanok
And
combination
robust
effective
method
alleviate
SRLs
(M`arquez
Methods
bootstrapping
Kate
2007)
unannotated
tagged
retrain
About
10%
fragments
contain
1%
encode
traditionally
backoff
lattice
consists
eight
connected
five-feature
lexical
levels
scalability
unknown
limited
standard
2005b)
More
details
found
Local
Following
practice
prediction
These
testing
various
sources
n-best
chunks
named
entities
apply
traditional
boundary
(TBC)
(TRC)
binary
corresponding
potential
greedy
adopted
Next
sentences
analyzed
provides
useful
main
module
Hence
framing
Semantic
Role
inclusion
voice
note
syntax
connecting
constituent-based
merging
(PTB)
(PRBK)
1993
experimented
(PB)
widely
providing
entire
top
N
consistent1
labelings
program
recent
seen
light
Baker
1998)
centre-stage
challenging
Polynomial
(PK
3)
bag
leaves
(TKL)
belief
step
requires
joint-inference
decompose
Structure
ker1http//wwwcsuntedu/rada/senseval/senseval3/
73
nel
compose
hybrid
SSN
history-based
However
except
tentative
explicitly
current
instead
emulated
position
Parsing
Machines
Sameer
Wayne
Ward
Kadri
James
H
Martin
Center
Spoken
Language
Research
University
Colorado
Boulder
CO
80303
fspradhanwhwhacioglumarting@cslrcoloradoedu
Dan
Department
Linguistics
Stanford
CA
94305
jurafsky@stanfordedu
Abstract
propose
extending
ENGLISH
GERMAN
CHINESE
(Skut
1997)
TrainSet
Section
2-21
Sentences
1-18602
Articles
26-270
DevSet
22
18603-19602
1-25
TestSet
23
19603-20602
271-300
Experimental
setup
Such
engineering
allows
experiment
syntactic/semantic
seamlessly
meanwhile
hidden
suggested
explored
eschew
1There
thirteen
modifiers
definitions
defining
own
framesets
phosphorylate
solve
errors
explore
views
On
arg-verb
relation
rp
di
distance
(w)
(t)
ps
pv
variations
pi
scalar
indicator
variables
(of
clauses
types)
common
ancestor
sf
complete
top-performing
(Johansson
reranking
scheme
means
k-best
attempts
improve
mul561
tiple
Driven
resources
(Baker
developed
achieved
F1
scores
near
80%
large-scale
580
Types
contains
annotations
PASs
superimposed
Marcus
Statistical
converted
proceeded
decades
lexicons
grammars
(Hirst
1987
Pustejovsky
1995
Copestake
Flickinger
labor-intensive
restricted
narrow
domainsThe
1990s
growth
eld
computational
linguistics
enabling
learn
complex
linguistic
knowledge
requiring
manual
encodingThese
acquiring
properties
frames
(Briscoe
Carroll
classifying
(Merlo
Stevenson
2001
Schulte
im
Walde
2006)Recently
medium-to-large
Ruppenhofer
al2004)
specically
derived
proven
particularly
feature-based
composed
Zhao
2009)
share
ideas
analyse
verb-argument
probabilistic
assign
instance
markedly
support-vector
machines
entity
headword
clusters
back-off
maximum-entropy
(He
implementation
SVM-Light-TK1
modified
barely
improvements
NPs
distributional
availability
rapid
extended
linear
interpolation
chosen
extract
chunk
significance
VerbNet
(Kipper
associations
mapped
onto
competing
competitions
Shi
Mihalcea
overall
competitive
leading
contemporary
employ
algorithms
2006)
predict
determined
(1999)
plenty
starting
CCG
mismatch
23%
Two
respective
performances
dependency-based
Swanson
Gordon
outperformed
ones
wide
margin
bulk
tagging
techniques
(2000
EmpiricalEvaluationsofSRLSystems
Many
experimental
conducted
seven
international
ACL-related
conferences
workshops
SIGNLL
SIGLEX
Senseval-3
(Litkowski
SemEval
al2007
M
`arquez
Ellsworth
Litkowski
Hargraves
2007)In
subsequent
summarize
conclusions
exercises
due
differences
scoring
methodologies
Nombank
nominalized
Chinese
modeling
front
discriminative
Thompson
prune
non-arguments
verbal
easily
adapted
detect
latter
From
view
architectures
study
relevance
worth
mentioning
evaluate
obtaining
roughly
70%
accuracy
prepositional
type
maximal
projection
dependent
Labeling
annotating
seThis
partially
supported
ARDA
AQUAINT
via
contract
OCG4423B
NSF
grants
IS-9978025
ITR/HCI
0086132
mantic
2000
Pred
HW
Conversion
Dependencies
321
exists
treebank
dependency-annotated
six
follows
past
editions
(sections
15-18)
(section
20)
21)
purely
resource
multi
stratal
projects
well-defined
drawing
applications
co-reference
resolution
(Ponzetto
Strube
Automatic
ILP
default
(Linear)
(Poly)
(PropBank)
avoids
issue
theory-agnostic
(Arg0
Arg5)
verb-specific
meanings
popular
seminal
campaigns
achieve
Comparing
retrieved
conclude
expansion
rule
noun
sub-categorization
Its
(Koomen
raw
level
processors
maintaining
real
minimal
subtree
includes
Second
emphasize
PK
surprisingly
exploits
originally
left
unmodified
Italian
explain
difference
meaning
Pennsylvania
BioProp
(a
bank)
previously
segment-based
unfavorable
heads
maybe
indicative
true
usually
(2002)s
closely
tied
surface-form
natural
adds
generalizes
alternations
denoted
asterisks
(*)
drawback
terms
Combinatory
Categorial
Grammar
(CCG)
Governing
frame-based
opposed
syntactic-oriented
schemes
(as
2005))
descriptors
underlying
table
rest
structural
identified
Regarding
component
Maximum
Entropy
(Fleischman
generative
(Thompson
Decision
Trees
(Hacioglu
2003a
2003b)
regularization
parameter
(option
-c)
equal
04
(see
2004))
participating
CoNLL-2004
Likelihood
(PML)
Estimation
comb
Argm-LOC
181
P(r
hw
pt
prepp)
pa
pr
pp)
vo
Global
tion
probabilities
well-studied
Mrques
goal
compare
involved
generalization
(Chen
units
(clauses
Atkins
1998
Hull
Gomez
1996)
phrases
(Hull
1996
Rosario
2002))
focused
Jiang
(Nielsen
Related
increasing
(NLP)
lications
(Kong
Pr
F
ip
Pfr
part-of-speech
semantic-role
Johnson
domain-independent
paradigm
(1)
(2)
inductive
obtains
17%
row
(PARA+PML)
datasets
(WSJ
02
BR+RL
(to
recognize
arguments)
F1828
comparison
185
proposals
maintain
locality
(Xia
VijayShanker
Joshi
extracting
etrees
P01R01R03R05		In
agent
recipient)
adjunct
ArgM-LOC
locative
ArgM-TMP
argument)
efforts
utilize
(ML)
perceptrons
SNoW
EMbased
clustering
(Baldewein
transformation-based
(Higgins
memory-based
(Kouchnir
implements
captures
dependencies
re-ranking
hand
researches
recognized
74
decide
correct
Other
looked
2005a
August
speed/accuracy
settings
required
360
hours
processor
25
GHz
PowerPC
G5
Unlike
(Poon
Domingos
lambda
calculus
formalism
define
treat
gold
With
unique
exception
exploration
inside
explanation
generation
beneficial
SVM-Light-TK
toolkit8
Similarly
FE
Supp
Cop
Asp
Exist
Null
None
Self_mover
Mrquez
Zhang
progress
fast
An
appeared
machine-learning
powerful
appropriate
2004b)
tree-adjoining
Similar
heuristic
starts
designating
signal
collects
siblings
Additionally
edges
pruned
crucial
identifying
identi
ed
gestalt
enables
passage
easier
link
91%
targets
recovered
despite
aggressive
Recently
PropBanked
Treebanked
reasons
suggest
solutions
obvious
template-filling
influence
LTAG-based
featureswe
Gold
2000)5
compact
served
lemma
(3)
left/right
themExtensions
directionsExploiting
ability
spaces
authors
rst
part-of-speech)
bag-of-words
n-grams
speech
elements
constituentParent
codied
al2005a
al2007)Other
specic
motivationsFor
al(2003)
generalized
concept
content
featureThey
featuresXue
pivotsAll
resulted
signicant
increase
detecting
event
whom
received
considerable
PropBank)
resolve
sparsity
employed
solution
combines
effectiveness
suggests
verb-similarity
compliment
role-similarity
Baldewein
avoid
1997
investigate
combine
hypotheses
taggers
rule-based
Minipar
(Lin
third
2004a)
SVMLight
modify
Tools
grammar
driven
Setting
Results
Moreover
combining
SST
hardly
former
(hereafter
referred
synPth)
continue
version
error
rate
100%
172%
retrained
confirm
findings
(i)
proposing
features)
(ii)modeling
(iii)
dealing
incorrect
cascaded
re-cast
matching
(Johnson
Classifier
Accuracy
(%)
88
79
77
11
investigated
applying
specifically
mind
Yi
Indeed
existence
surge
efficient
se
Arabic
refer
Modern
(MSA)
describes
constructing
50-best
coarse-to-fine
experienced
moderate
6949
measure
Ever
pioneering
article
Fpa
pairs
Jurasfky
Compressed
Distance
Prepositional
Phrases
processes
successfully
mandate
associated
activation
confidence
advent
faster
computers
importantly
Prob
seeing
FrameNet-based
targeted
February
SVMlight-TK
http//ai-nlpinfouniroma2it/moschitti/
SVM-light
inferred
deals
multiple
During
enforcing
nonoverlapping
graph
transformation
short
post
Baseline
b1
replacement
b2
NN
b3
b4
Bernanke
b5
NPSVPVPPPNPNN
b6
b11
Ben
NNP
b12
NULL
VP
b13
VBD
b14
S
b15
b16
b17
b18
NP-7
b19
b20
NPS
b21
NPSVPVPPPNP
Combined
b31
b32
b33
b34
instantiations
assuming
NP-Ben
AST-based
state-ofthe-art
(CoNLL
return
Dang
Ng
Liu
Finally
contribution
relates
organization
original
formulation
answers
Is
governed
IP
VP?
Therefore
rules
unlikely
(x&p)
soft
(softp)
Recent
successes
Henderson
brought
forth
hope
ambitious
recovering
semantics
flaw
(not
adjuncts)
subject
hard
constraint
label3
Not
benchmarks
Santorini
Marcinkiewicz
serve
future
Duffy
(Henderson
Brill
investigation
variation
bilexical
sample
(Hwa
non-English
Resnik
Weinberg
extensions
procedures
pioneered
championed
Haghighi
(Marquez
Turmo
state-of-theart
SPs
SwiRL
matched
predicted
internally
SwiRLs
sequential
collection
Consider
non-local
(such
control
WH-extraction
topicalization)
richness
(Dzikovska
related
three-step
exceptions
Collobert
Weston
published
sort
Third
design
noticeable
effort
Models
1/2
undo
movement
trace
exploited
involves
generate
over-complete
fac1Charniak
cites
895%
relied
representations
By
habit
role-semantic
Pennstyle
(1997)
32
children
(children)
excludes
(noFarChildren)
VOICE
Active
passive
HEAD
WORD
OF
SUB-CAT
CFG
Additional
FIRST/LAST
LEFT/RIGHT
SISTER
PHRASE-TYPE
WORD/POS
PARENT
POS/HEAD-WORD
ORDINAL
TREE
DISTANCE
appended
length
NODE-LCA
PARTIAL
Lowest
Common
Ancestor
If
parents
retrieve
rightmost
Selected
Pairs
chained
principled
Equation
contained
112917
labeled
instances
4250
rolesets
3257
illustrated
buy
keeping
Typical
Source
adjuncts
Temporal
Manner
Extent
Since
Translation(Boas
significantly
CCGBank
earlier
Blaheta
spans
high-recall
realized
active
construction
claim
approximately
11%
instantiation)
(NP
etc)
alternative
insights
discussion
84
(Ruppenhofer
(wwwcisupennedu/ace)
PennTree
listed
2002)A
compares
Hybrid
PAF
Linear
Poly
(d
2)
computation
calculated
P
(r
(pr
claims
trade-off
more-specific
coverage
less-specific
subsets
exponential
doubly
NPcomplete
NSTs
Kernels
implement
Tree-Based
Recognition
Algorithm
(PARA)
preprocessing
kNN
PML
deliver
6861
7102
respectively
WSJ23
5696
6055
Corpus
828
measurement
jF
p)
P(fr
1n
gjp)
appearing
formula
Y
jp)
interaction
assignments
independence
assumptions
estimation
extent
overlap
(Zelenko
Named
Entity
(Cumby
Roth
Culotta
Sorensen
singular
Boxwell
Initially
Several
submitted
41
lists
PropBank-based
rationale
DL
learner
essentially
experience
weights
smoothing
stated
Because
5%
branching
decisions
scales
policies
style
Due
Looking
description
edition
strongly
attribute-values
CCG-based
2003)7
generalize
probably
salient
(while
sparse)
integrated
modifying
guideline
interpreting
8167
observations
threshold
05
absolute
determine
SSTs
SCF
improves
AX
AM
CX
RX
superimposes
typical
elementary
frameworks
community
"Earthquake"
trending
Twitter
Search
thousands
updates
daunting
people
huge
news
tweets
motivating
conduct
http//blogtwittercom/2008/07/twitter-as-news-wirehtml
698
mining
53700
xed
split
million
fair
CoNLL-04
tackle
Annotations
automated
require
Release
G
K
L
R
sparse
difficult
Given
variability
affect
applicationsGildea
exploring
usedTo
abstract
thematic
(ie
Location)
concluded
149
Computational
Volume
34
Number
degradationSimilar
domain-specic
dependence
dataGiven
uncertainty
status
lack
evidence
ongoing
focus
value
(Swier
Loper
Accordingly
hereby
human-labeled
texts
Generally
speaking
i)
ii)
derivation
Jurafskys
pioneer
target
depends
arguments1
of)
fea140
stemmed
subcat
expands
word/POS
spanned
(b11FW
b11LW
b11FP
b11LP)
sister
(b12L
b12R)
sisters
(b13LH
b13LP
b13RH
b13RP)
(b15H
b15P)
tag
(b17H
b17P)
keyword
Monday
lowest
projected
dominating
tures
mappings
replace
morphological
WordNet
wide-coverage
naturally
occurring
play
Translation
(Boas
Fung
parse-trees
high-accuracy
cation
classi
a3a5a4
FS1
8496
8426
8461
7876
hPos
9224
8450
8820
7904
cw
cPos
9219
8467
8827
8080
cNE
8393
8569
8480
7985
NE
8778
8571
8673
8128
pvcSum
8488
8277
8381
7862
pvcMax
FS2
9162
8506
8822
8305
Inductive
assignment
Model
Implementation
Palmer)
7186
7887
8898
8374
Comparison
decision
decision-tree-based
SVMbased
IOB
tagger
reached
70
pair
exactly
positive
(T+r
else
negative
examples
(Tr
programs
goals
statistics-based
tool
hand-coded
generating
constituency
whereas
LTH
(described
2008a))
dividing
phases
conquering
individually
analyzing
Sarkar
exploiting
complicated
predicate-structure
paradigmatic
(Gordon
ltering
pruning)
predicateBecause
continuous
discontinuous
subsequence
candidateExhaustive
space
feasible
imbalanced
actual
verb)The
greatly
reduce
recall
releases
option
Rich
allowed
Dienes
Jijkoun
de
Rijke
Toutanovaetal
annotators
Laboratory
Linguistic
Processing
(BLLIP)
Gigaword
newswire
(GW)
ourselves
encouraging
calibration
authority
dropped
midnight
Tuesday
280
trillion
(taken
00
deeper
databases
paradigms
Details
paths
descriptive
relationship
careful
reveals
adoption
studied
ST
surface-syntax
(2002))
experimentally
30
Lexical
(5)
(verb)
immediately
extensively
selective
portions
reports
produces
segmenter
961
F1-measure
Berkeley
825
855
F1measure
golden
segmentation
modeled
line
gained
interdependencies
lot
promise
They
address
added
chunking
banks
Penn-style
consistent
realizations
Inspired
idea
constructed
broadly
2006)4
extend
nouns
prepositions
aspects
class
null
labelers
benefit
spectrum
ranging
(Shen
translation
(Wu
summarization
PropBanks
combinatory
categorial
(Steedman
Treebank-based
System
809
768
788
810
704
753
Table4
Evaluation
(12
iterations)
oracle
f-score
numbered
(A0
A5)
List
Freq
senses
/set
106
/emerge
80
/publish
113
/give
3/2
/build
2/3
/enter
123
/take
230
/pass
75
/hope
90
/increase
167
Test
adverbial
beneficiary(eg
[to
plan])
object
condition
companion
talk
[with
you])
frequency
location
manner
purpose
reason
range(eg
help
[in
aspect])
result(eg
$100])
source(eg
[from
$50]
$100)
topic
31
Architecture
1-of-N
Examples
linearly
interpolated
gains
suggesting
partly
complementary
derivable
lexicalization
range
linguistically
motivated
carefully
hand-engineered
subcategorizations
break
wrong
context-freedom
naive
covering
PCFG
differentiating
base
phrasal
distinguishing
empty
subjects
overt
7863%
cast
(905%)
7f1
assigns
Precision
Recall
f1
2P
RP+R
substantially
(88%)
(852%)
820%
Conference
Natural
Learning
(CoNLL)
A0A1R01
stand
ARG0
ARG1
maxent
computes
pred
ptype
pos
sub-cat
expanding
Advanced
hw/POS
child
first/last
partPath
proPath
directions
Combinations
conditional
P(a|tpv)
argmax
P(a|(tpv))
()
map
initial
(G&J)
series
modifications
LTAG-spinal
overcome
limitations
(Liu
source
complement/adjunct
localized
leads
loss
Basic
records
before/after
LCA(Lowest
CommonAnce
stor)
trigrams
PER
ORG
LOC
Fig
benchmark
campaign
Different
127
decision-list
syntactic-frame
discuss
decomposition
parsing)
Split
taskthe
CoNLL-2005
labelling(SRL)ashas
collecting
Compared
wealth
Fleischman
Hovy
(2003))
relatively
addresses
utilizes
modification
(pr)
(vo)
(pt)
(di)
(hw)
(pa)
Preposition
(pp)
Actor
050
precision
058
F-measure
054
head-word
dominated
consecutive
chunker
start
total
52
promising
reveal
Introduction
Robust
(Ratnaparkhi
Bangalore
Abeille
major
field
Setup
Predicate-Constituent
best-reported
consideration
annotationsMost
robustness
gain
effects
errorsOne
al2005b)
changing
Manning
2005)The
selecting
nal
outputFinally
involve
notThe
consistently
pointsHowever
increases
complexity
penalizes
efciency
Perhaps
closest
ours
preliminary
nominalizations
630
annotates
lexicon
role-annotated
corpusThe
enabled
constituentsAlthough
spurred
wave
148
rened
extensivelyOne
representative
illustrate
itemAnother
situation-specic
Location
situations
genres
Full
well-known
started
Methodologically
direct
inmost
87%
low
40
replicating
2004)Participants
assigning
92%
segmenting
83%
Availability
(Bies
1995)
stimulated
Firstly
26
"standard"
(c1)
(c2)
(c3)
(c4)
(c5)
(c6)
(c7)
Another
similarity
measures
drawbacks
49
Highly
detection
substructures
consisting
02-21
stressing
differ803
ences
handcrafted
linguistically-motivated
supporting
well-dened
substantial
comparative
[2002]
al[2003]
[2004]
al[2005a]
Shared
Task
SemEval-2007)The
identication
potentially
benet
al2003)
al2005)
2002)Related
(Moldovan
al2004
Hearst
features2
aim
encouraged
accurately
proS
a8a8
a8a8a8
a72a72
a72a72a72
NP-SBJ
a16a16a16
a16a16a16a16
a0
a0a0
a64
a64a64
a80a80a80
a80a80a80a80
PP-TMP
a72a72IN
NP-TMP
PP-DIR
a72a72TO
QP
a80a80a80$
broad-coverage
human-annotated
Knowledge
essential
understanding
recognizing
textual
entailment
(Burchardt
Noun
appear
Furthermore
labelled
apparently
inappropriate
representing
shortest
Corpora
set-up
(wwwcisupennedu/
ace)
TreeBank5
usual
depart
conjunctions
broad
decrease
sensitive
~10
regards
papers
surpass
6%
See
detailed
decade
success
(Magerman
transformations
superset
quality
(according
model)
0897
inter-annotator
agreement
09
Kappa
statistic
(Sidney
Castellan
Jr
1988)
Using
CCGbased
2%
Train
Devel
tWSJ
tBrown
39832
1346
2416
426
Tokens
950028
32853
56684
7159
Propositions
90750
3248
5267
804
239858
8346
14077
2177
Counts
modules
CONLL2005
(Gimenez
(2000)s
Chieu
(2003)s
recognizer
F-Measure
constituent-by-constituent
(Cby-C)
P-by-P
generalizing
frequently
maximize
Detecting
spite
difficulties
adequate
